---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure
source: html/670867bb-1127-bf10-c811-e0600b2bc093.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure Property

The parameter runwidth is great or the parameter min width at inside boundary is too great, or number of parallel treads at both ends is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderRunWidthOrMinWidthOrTooGreatParallelTreadsFailure { get; }
```